f =open ("two_cities_ascii.txt","r")
x = f.read()
f.close()
pl = 0
athr7 = 0
athr5 = 0
athr3 = 0
athr = 0
pl1=""
#απεικόνιση κάθε χαρακτήρα σε δυαδικό μήκους 7 και κρατάτε τα πρώτα δύο και τα τελευταία δύο bits
for i in x:
    y = ord(i)
    y = bin(y).replace("ob","")
    y = y[2:].zfill(7)
    z = y[0:2] + y[6:8]
    pl1 += z
#Χωρίζουμε  σε αριθμούς των 16 bits και βρίσκουμε το πλήθος
for i in range(0, len(pl1), 16):
    pl+= 1
    z = int(pl1[i:i+16], 2)
#Ελέγχουμε αν διαιρείται ακριβώς ο αριθμός με το αντοίστιχο αριθμό που θέλουμε
    if z%7 == 0:
        athr7 =athr7 + 1
    if z%5 == 0:
        athr5 =athr5 +1
    if z%3 == 0:
        athr3 =athr3 + 1
    if z%2 == 0:
         athr =athr + 1
print("Το ποσοστό ζυγών είναι:", (athr/pl*100),"%")
print("Το ποσοστό που διαιρείται ακριβώς με το 3 είναι:", athr3/pl*100,"%")
print("Το ποσοστό που διαιρείται ακριβώς με το 5 είναι:", athr5/pl*100,"%")
print("Το ποσοστό που διαιρείται ακριβώς με το 7 είναι:", athr7/pl*100,"%")
